#+TITLE: Hacking

#+PROPERTY: header-args:bash :exports both :results verbatim :tangle no

* Notes

+ The main development environment is Kubuntu 21.10.
+ The main production environment is Kubuntu 20.04
+ Work occurs in Docker, but even so is not [[https://stackoverflow.com/questions/70906750/reproducible-issues-with-python-statsmodel-and-docker][bit-reproducible]].
  + https://hub.docker.com/r/mankoff/ice_discharge/tags


* Development Environment
** Install Docker 
** Fetch Data

The data files could be in the VM or external to the VM and accessible by a "shared folder".

The ~DATDIR~ environment variable needs to be set the folder that contains the various data subfolders. On =bash=, this is done with ~export DATADIR=/path/to/dir~. Run each time or add to =~/.bash_profile= so that it is always done for you.

We use the following folders of data in this work. 

Check the =md5sum= hashes reported in ice_discharge.org

#+BEGIN_SRC bash :exports code
tree -d -L 2 ${DATADIR}
#+END_SRC

#+RESULTS:
#+begin_example
/media/kdm/DISCHARGE/data/
├── Bamber_2013
├── Bjørk_2015
├── GIMP
│   └── 0715
├── Khan_2016
├── MEaSUREs
│   ├── NSIDC-0478.002
│   ├── NSIDC-0646.002
│   └── NSIDC-0731.001
├── Millan_2018
├── Morlighem_2017
├── Mouginot_2018
│   ├── D1GW91
│   └── D1MM37
├── Mouginot_2019
└── Sentinel1
    └── Sentinel1_IV_maps

17 directories
#+end_example

** Run code

+ Make sure ~DATADIR~ is defined

#+BEGIN_SRC bash
make
make all
#+END_SRC

After this, results should exist.
+ Figures in =./figs= folder
+ Data in =./out/= folder

When comparing results between machines, I have been unable to get bit-reproducibility.
GIS-wide results usually change by ~0.1 %.
Individual glacier results change by up to 1 %.

* Miscellaneous
** jupyter+pandas output Org tables

In order for the Babel code blocks to print Org tables (and not HTML tables), the following code needs to be placed into =~/.ipython/profile_default/startup/50-middle.py=:

#+BEGIN_SRC python :tangle ~/.ipython/profile_default/startup/50-middle.py :mkdirp ~/.ipython/profile_default/startup
## this make emacs-jupyter only show Org (not HTML) as results
# https://github.com/gregsexton/ob-ipython
try:
  import IPython
  from tabulate import tabulate
  class OrgFormatter(IPython.core.formatters.BaseFormatter):
      def __call__(self, obj):
        try:
          return tabulate(obj, headers='keys', tablefmt='orgtbl', showindex='always')
        except:
          return None

  ip = get_ipython()
  ip.display_formatter.formatters['text/org'] = OrgFormatter()
except ImportError:
  print("no tabulate")
#+END_SRC

